In [0]:
"""Making buddymove_holidyiq.sqlite3"""

import pandas as pd
import sqlite3

In [3]:
# Loading the dataset in pandas

df = pd.read_csv('https://raw.githubusercontent.com/Skantastico/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module1-introduction-to-sql/buddymove_holidayiq.csv')

df

      User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0      User 1       2         77      79       69        68      95
1      User 2       2         62      76       76        69      68
2      User 3       2         50      97       87        50      75
3      User 4       2         68      77       95        76      61
4      User 5       2         98      54       59        95      86
..        ...     ...        ...     ...      ...       ...     ...
244  User 245      18        139     148      129       129     168
245  User 246      22        114     228      104        84     168
246  User 247      20        124     178      104       158     174
247  User 248      20        133     149      139       144     213
248  User 249      20        143     149      139       159     143

[249 rows x 7 columns]

In [4]:
# Create sql using sqlite3 package

conn = sqlite3.connect('data')

df.to_sql('data', conn, if_exists='replace')

curs = conn.cursor()

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [5]:
# How many rows?

query = '''SELECT * FROM data'''

num_rows = curs.execute(query)
print(f'Database contains {len(num_rows.fetchall())} rows')

Database contains 249 rows

In [8]:
# How many users reviewed at least 100 Nature and at least 100 Shopping?

query = ''' SELECT "User id" from data WHERE Nature > 100 AND Shopping > 100'''

user_rev = curs.execute(query)
print(f'{len(user_rev.fetchall())} reviewers for both Nature and Shopping > 100')

78 reviewers for both Nature and Shopping > 100